app/Models/SanteModel.php

SELECT *
FROM `sante`
WHERE `utilisateur_id` = '1'
 LIMIT 1
---
    public function getSanteByUtilisateurId($utilisateurId)
    {
        return $this->where('utilisateur_id', $utilisateurId)->first();