app/Models/UtilisateurModel.php

    public function getUtilisateurByEmail($email)
    {
        return $this->where('email', $email)->first();
---
SELECT *
FROM `utilisateurs`
WHERE `email` = 'batman@gmail.com'
 LIMIT 1